<!-- dflook/terraform-github-actions {"workspace":"bookworm-really","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"a73d102e483e20e829b16023fafb4bc433f4950b968dbd12288d7a5b92d2d19e","plan_job_ref":"Job Test actions using target and replace #505 at https://github.com/dflook/terraform-github-actions/actions/runs/15345466048","plan_hash":"0bc6cc525040fcb366a26ed99166b8dbd70ad66db1ce2f62700fd6ba3e718091","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __bookworm-really__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "lgT47NVIIu" -> (known after apply)
!~  foreach = "hL1V61jh3k" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #505](https://github.com/dflook/terraform-github-actions/actions/runs/15345466048)